Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
/****************************************************************************
 * boards/arm/bk7258/contest_board/chip/bk7258_bt_osi.c
 *
 * OS abstraction table for the closed Beken bluetooth controller.
 *
 * The controller archive owns no OS code: everything it needs -- queues,
 * threads, timers, locks, power and clock gates, the interrupt hookup and
 * the PHY calibration entry points -- arrives through one function-pointer
 * table handed to bt_os_adapter_init().  The library reads that table by
 * memory layout, so struct bt_osi_funcs_t below is a byte-for-byte replica
 * of bk_idk components/bk_bluetooth/include/private/bt_os_adapter.h; the
 * SDK header itself is deliberately not included, because this port does
 * not carry the Beken header tree.  Field order and types must not be
 * touched, and the version/size pair is the handshake the library checks
 * before it accepts the table.
 *
 * The implementations are re-derived from the vendor's FreeRTOS reference
 * (bk_idk components/bk_bluetooth/soc/bk7236/bluetooth.c) onto NuttX
 * primitives.  Where the vendor calls into an SDK subsystem this port does
 * not have -- power management, coexistence, the UART passthrough used by
 * production test -- the field is a documented stub rather than a guess.
 *
 * Nothing here runs unless bk7258_bt_osi_init() is called; it is not wired
 * into board bring-up yet.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/kthread.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/wqueue.h>

#include "arm_internal.h"
#include "chip.h"
#include "bk7258_gpio.h"
#include "bk7258_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Handshake the library validates before it uses the table at all. */

#define BT_OSI_VERSION              0x00010001

/* Vendor timeout encoding (bk_idk include/os/os.h). */

#define BT_OSI_NO_WAIT              (0)
#define BT_OSI_WAIT_FOREVER         (0xffffffffu)

/* Beken/FreeRTOS priorities run the opposite way from NuttX: the vendor
 * layer converts with BK_PRIORITY_TO_NATIVE_PRIORITY(p), which is
 * (configMAX_PRIORITIES - 1) - p with configMAX_PRIORITIES == 10, so
 * beken 0 is the most urgent and beken 9 the least.  NuttX counts up
 * instead, so the mapping is a reflection plus an offset.
 *
 * The offset places the whole band above every application thread this
 * board runs (nsh and the system work queue sit at 100..110) and below
 * CONFIG_SCHED_HPWORKPRIORITY (224), which is where the OSI timer
 * callbacks below execute.  Keeping the timers above the controller
 * threads reproduces the FreeRTOS arrangement, where the timer daemon
 * preempts the stack tasks, and keeping the controller below HPWORK means
 * a spinning controller thread cannot starve NuttX's own deferred work.
 */

#define BT_OSI_BEKEN_PRIO_MAX       9
#define BT_OSI_PRIO_BASE            200

/* System block gates.  Power bits are inverted: 0 powers the domain up. */

#define BT_OSI_SYS_POWER            (BK7258_SYS_BASE + 0x40)
#define BT_OSI_PWD_BTSP             (1u << 8)
#define BT_OSI_PWD_WIFP_PHY         (1u << 10)

#define BT_OSI_SYS_CLK_EN           (BK7258_SYS_BASE + 0x30)
#define BT_OSI_CKEN_BTDM            (1u << 24)
#define BT_OSI_CKEN_XVR             (1u << 25)

/* Registers the library asks for by address so it can poke them itself. */

#define BT_OSI_SYS_DEBUG_CFG0       (BK7258_SYS_BASE + (0x38 << 2))
#define BT_OSI_SYS_DEBUG_CFG1       (BK7258_SYS_BASE + (0x39 << 2))
#define BT_OSI_AON_PMU_CHIPID       (BK7258_AON_PMU_BASE + (0x7c << 2))

/* Chip identity constants, copied from the SDK's bk7258 sys_types.h. */

#define BT_OSI_CHIP_ID_MASK         0xffff0000ul
#define BT_OSI_CHIP_ID_MPW_V4       0x22c20010ul

/* RF arbitration bits (bk_idk components/bk_phy/include/bk_rf_internal.h) */

#define BT_OSI_RF_BY_BLE_BIT        (1u << 1)
#define BT_OSI_RF_BY_ATE_BT_BIT     (1u << 4)

/* The rate index the vendor files BLE calibration results under. */

#define BT_OSI_EVM_BLE_RATE         158

/* Replicated from bt_os_adapter.h -- the library and this file must agree
 * on these encodings even though the header is not included.
 */

#define BLUETOOTH_RF_PLL_WIFI       0x1
#define BLUETOOTH_RF_PLL_MASK       0xf
#define BLUETOOTH_RF_MODE_POLAR     0x10
#define BLUETOOTH_RF_MODE_MASK      0xf0

#define BLUETOOTH_CLK_32K           32000
#define BLUETOOTH_CLK_32768         32768

enum
{
  BLUETOOTH_INT_SRC_BTDM = 0x00,
  BLUETOOTH_INT_SRC_BLE  = 0x01,
  BLUETOOTH_INT_SRC_BT   = 0x02,
};

enum
{
  BT_LPO_SRC_DIVD = 0,          /* 32K divided down from the 26 MHz xtal */
  BT_LPO_SRC_X32K,              /* External 32.768 kHz crystal          */
  BT_LPO_SRC_ROSC,              /* 32K from the internal RC oscillator  */
  BT_LPO_SRC_DEFAULT
};

enum
{
  BT_RF_MODE_WIFI = 1,
  BT_RF_MODE_POLAR,
};

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Verbatim replica of struct bt_osi_funcs_t.  Do not reorder or retype. */

struct bt_osi_funcs_t
{
  uint32_t _version;
  uint32_t size;

  int (*_init_queue)(void **queue, const char *name, uint32_t message_size,
                     uint32_t number_of_messages);
  int (*_deinit_queue)(void **queue);
  int (*_pop_from_queue)(void **queue, void *message, uint32_t timeout_ms);
  int (*_push_to_queue)(void **queue, void *message, uint32_t timeout_ms);
  int (*_create_thread)(void **thread, uint8_t priority, const char *name,
                        void *function, uint32_t stack_size, void *arg);
  int (*_delete_thread)(void **thread);
  int (*_thread_join)(void **thread);

  int32_t (*_init_mutex)(void **mutex);
  int32_t (*_lock_mutex)(void **mutex);
  int32_t (*_unlock_mutex)(void **mutex);
  int32_t (*_deinit_mutex)(void **mutex);

  int32_t (*_init_semaphore)(void **semaphore, int32_t max_count);
  int32_t (*_set_semaphore)(void **semaphore);
  int32_t (*_get_semaphore)(void **semaphore, uint32_t timeout_ms);
  int32_t (*_deinit_semaphore)(void **semaphore);

