Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
  int32_t (*_init_timer)(void **timer, uint32_t time_ms, void *function,
                         void *arg);
  int32_t (*_init_timer_ext)(void **timer, uint32_t time_ms, void *function,
                             void *arg, bool oneshot);
  int32_t (*_deinit_timer)(void *timer);
  int32_t (*_stop_timer)(void *timer);

  int32_t (*_timer_change_period)(void *timer, uint32_t time_ms);
  bool (*_is_timer_init)(void *timer);
  int32_t (*_start_timer)(void *timer);
  bool (*_is_timer_running)(void *timer);

  void (*_log)(int level, char *tag, const char *fmt, ...);
  uint32_t (*_get_time)(void);
  int (*_delay_milliseconds)(uint32_t num_ms);

  void *(*_malloc)(unsigned int size);
  void (*_free)(void *p);

  int (*_coex_init)(void);
  int (*_bluetooth_int_isr_register)(uint8_t type, void *isr, void *arg);

  void (*_controller_mem_init)(void);
  int (*_bluetooth_deep_sleep_register)(void *enter_config_cb);
  int (*_bluetooth_extern32k_register)(void *switch_cb);
  int (*_bluetooth_extern32k_unregister)(void);
  uint8_t (*_clk_32k_customer_config_get)(void);
  int (*_lpo_src_set)(uint8_t lpo_src);
  uint8_t (*_lpo_src_get)(void);
  int (*_bluetooth_power_ctrl)(uint8_t power_state);
  int (*_phy_power_ctrl)(uint8_t power_state);
  int (*_bt_mac_clock_ctrl)(uint8_t clock_state);
  int (*_bt_phy_clock_ctrl)(uint8_t clock_state);
  void (*_btdm_interrupt_ctrl)(bool en);
  void (*_ble_interrupt_ctrl)(bool en);
  void (*_bt_interrupt_ctrl)(bool en);
  bool (*_ate_is_enabled)(void);
  bool (*_cp_test_is_enabled)(void);
  int (*_get_bluetooth_mac)(uint8_t *mac);
  int (*_uart_write_byte)(uint8_t id, uint8_t data);
  void (*_register_ble_dump_hook)(void *ble_func);
  uint8_t (*_get_ble_pwr_idx)(uint8_t channel);
  void (*_ble_cal_set_txpwr)(uint8_t idx);
  void (*_ble_cal_recover_txpwr)(void);
  void (*_ble_cal_enter_txpwr)(void);
  int (*_gpio_dev_unmap)(uint32_t gpio_id);
  int (*_gpio_dev_map)(uint32_t gpio_id, uint32_t func);
  void (*_set_printf_enable)(uint8_t enable);
  void (*_evm_stop_bypass_mac)(void);
  void (*_rs_deinit)(void);
  void (*_phy_enable_rx_switch)(void);
  int (*_uart_enable_rx_interrupt)(uint8_t id);
  int (*_uart_take_rx_isr)(uint8_t id, void *isr, void *param);
  void (*_ble_vote_rf_ctrl)(uint8_t cmd);
  void (*_ble_ate_vote_rf_ctrl)(uint8_t cmd);

  uint32_t (*_disable_int)(void);
  void (*_enable_int)(uint32_t int_level);
  int (*_gpio_disable_pull)(uint32_t gpio_id);
  int (*_gpio_enable_output)(uint32_t gpio_id);
  int (*_gpio_set_output_high)(uint32_t gpio_id);
  int (*_gpio_set_output_low)(uint32_t gpio_id);
  int (*_gpio_pull_down)(uint32_t gpio_id);
  int (*_gpio_pull_up)(uint32_t gpio_id);
  int (*_get_printf_port)(void);
  void (*_uart_enable)(uint8_t uart_id, uint8_t enable, uint32_t band);
  void (*_enable_debug_gpio)(void);

  void (*_manual_cal_save_ble_txpwr)(uint32_t channel, uint32_t pwr_gain);

  uint32_t (*_bt_rf_pll_ctrl)(uint32_t set);
  void (*_reboot)(void);
  int (*_uart_read_byte_ex)(uint8_t id, uint8_t *ch);
  int (*_bt_vote_sleep_ctrl)(uint32_t sleep_state, uint32_t sleep_time);
  void (*_coexist_check_large_signal)(uint8_t switch2bt);
  void (*_bt_ext_wakeup_ctrl)(uint8_t enable);
  void (*_btsnoop)(uint8_t uart_id, uint8_t pkt_type, uint8_t is_rxed,
                   uint8_t *pkt, uint16_t pkt_len, uint8_t method);

  size_t (*_get_sys_debug_config_addr)(uint32_t index);
  uint32_t (*_get_chipid_mask)(void);
  uint32_t (*_get_chipid)(uint32_t ver);
  uint32_t (*_get_current_chipid)(void);
  uint32_t (*_get_test_rfconfig)(void);
  uint8_t (*_get_rf_mode)(void);

  int (*_bkreg_run_command)(const char *content, int cnt);

  uint32_t (*_manual_cal_txpwr_tab_ready_in_flash)(void);
  uint32_t (*_manual_cal_is_in_cali_mode)(void);
  double (*_bk_driver_get_rc32k_freq)(void);
  void (*_flush_dcache)(void);

  void (*_ble_enter_dut)(void);
  void (*_ble_exit_dut)(void);
  uint8_t (*_set_bluetooth_power_level)(float pwr_gain);
};

/* Ring buffer behind the OSI queue API.  NuttX message queues need a file
 * system name and a POSIX descriptor, which buys nothing here and makes
 * the timeout encoding awkward, so the queue is open-coded: the ring state
 * is protected by an interrupt lock (the only contention is the BLE ISR
 * against the controller threads), 'fill' counts queued messages for
 * blocked readers, and 'space' is a wakeup signal for blocked writers.
 */

struct bt_osi_queue_s
{
  uint8_t *buf;
  uint32_t msgsize;
  uint32_t capacity;
  uint32_t head;
  uint32_t tail;
  uint32_t used;
  sem_t    fill;
  sem_t    space;
};

/* The vendor entry point is void(*)(void *) in both the periodic and the
 * one-shot case; the one-shot flavour reaches it through a two-argument
 * shim that only forwards.  'exited' lets _thread_join() block on a plain
 * kernel thread, which NuttX otherwise offers no way to wait for.
 */

struct bt_osi_thread_s
{
  pid_t  pid;
  void (*entry)(void *arg);
  void  *arg;
  sem_t  exited;
};

/* OSI timers run on the high-priority work queue, not on a watchdog.
 * The vendor's timers are FreeRTOS software timers, so their callbacks
 * execute in the timer daemon *task*: the controller is free to take a
 * mutex or push to a queue with a timeout from inside one.  A NuttX wdog
 * callback runs in interrupt context, where all of that either asserts or
 * deadlocks, so wd_start() would silently change the contract.  HPWORK
 * keeps the callback in a schedulable context and is enabled on this
 * board (CONFIG_SCHED_HPWORK).
 */

struct bt_osi_timer_s
{
  struct work_s work;
  void        (*cb)(void *arg);
  void         *arg;
  uint32_t      ms;
  bool          oneshot;
  bool          running;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Closed PHY/calibration entries.  Every one of these was confirmed
 * present in bk_idk components/bk_libs/bk7258/libs/libbk_phy.a (and in
 * libcom_phy.a) with arm-none-eabi-nm before being declared here; a
 * missing symbol is a link failure, so nothing is declared on faith.
 */

extern uint8_t manual_cal_get_ble_pwr_idx(uint8_t channel);

