Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
static uint8_t bt_osi_ble_pwr_idx(uint8_t channel);
extern void ble_cal_set_txpwr(uint8_t idx);
extern void ble_cal_recover_txpwr(void);
extern void ble_cal_enter_txpwr(void);
extern void ble_cal_enter_dut(void);
extern void ble_cal_exit_dut(void);
extern uint8_t get_ble_txpwr_table_size(void);
extern void rf_module_vote_ctrl(uint8_t cmd, uint32_t module);
extern void manual_cal_save_txpwr(uint32_t rate, uint32_t channel,
                                  uint32_t pwr_gain);
extern uint32_t manual_cal_txpwr_tab_ready_in_flash(void);
extern uint32_t manual_cal_is_in_rftest_mode(void);
extern int manual_cal_set_tx_power(int standard, float power_dbm);

/* test_rfconfig is a 4-byte object; rwnx_rfconfig is only 2 (checked with
 * nm -S).  The vendor's bluetooth.c declares the latter uint32_t and so
 * reads two bytes past it -- harmless on their layout, but there is no
 * reason to copy the mistake.
 */

extern uint32_t test_rfconfig;
extern uint16_t rwnx_rfconfig;

/* Already implemented for the closed libraries in bk7258_ble_shim.c; the
 * OSI table reuses them rather than defining a second copy.
 */

extern uint32_t rtos_disable_int(void);
extern void rtos_enable_int(uint32_t flags);
extern int rtos_init_mutex(void **mutex);
extern int rtos_lock_mutex(void **mutex);
extern int rtos_unlock_mutex(void **mutex);

/* The controller's own entry point. */

extern int bt_os_adapter_init(void *osi_funcs);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bt_osi_wait_sem
 *
 * Description:
 *   Apply the vendor timeout encoding to a NuttX semaphore: 0 never
 *   blocks, 0xffffffff blocks forever, anything else is milliseconds.
 *   MSEC2TICK rounds up, so a millisecond count shorter than the 10 ms
 *   tick of this board still waits one tick instead of degenerating into
 *   a poll.  Waits are uninterruptible because the controller has no way
 *   to report or recover from EINTR.
 *
 ****************************************************************************/

static int bt_osi_wait_sem(sem_t *sem, uint32_t timeout_ms)
{
  if (timeout_ms == BT_OSI_NO_WAIT)
    {
      return nxsem_trywait(sem);
    }

  if (timeout_ms == BT_OSI_WAIT_FOREVER)
    {
      return nxsem_wait_uninterruptible(sem);
    }

  return nxsem_tickwait_uninterruptible(sem, MSEC2TICK(timeout_ms));
}

/****************************************************************************
 * Name: bt_osi_init_queue / bt_osi_deinit_queue
 ****************************************************************************/

static int bt_osi_init_queue(void **queue, const char *name,
                             uint32_t message_size,
                             uint32_t number_of_messages)
{
  struct bt_osi_queue_s *q;

  UNUSED(name);

  if (queue == NULL || message_size == 0 || number_of_messages == 0)
    {
      return -1;
    }

  q = kmm_zalloc(sizeof(struct bt_osi_queue_s));
  if (q == NULL)
    {
      return -1;
    }

  q->buf = kmm_malloc(message_size * number_of_messages);
  if (q->buf == NULL)
    {
      kmm_free(q);
      return -1;
    }

  q->msgsize  = message_size;
  q->capacity = number_of_messages;

  nxsem_init(&q->fill, 0, 0);
  nxsem_init(&q->space, 0, number_of_messages);

  *queue = q;
  return 0;
}

static int bt_osi_deinit_queue(void **queue)
{
  struct bt_osi_queue_s *q;

  if (queue == NULL || *queue == NULL)
    {
      return -1;
    }

  q = *queue;
  *queue = NULL;

  nxsem_destroy(&q->fill);
  nxsem_destroy(&q->space);
  kmm_free(q->buf);
  kmm_free(q);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_push_to_queue
 *
 * Description:
 *   The BLE interrupt pushes link-layer events into these queues, and the
 *   vendor layer switches to xQueueSendToBackFromISR there, dropping the
 *   timeout entirely.  Mirror that: from interrupt context this never
 *   blocks and reports failure on a full ring.
 *
 *   'space' is only a hint that a slot was freed -- an interrupt-side push
 *   consumes a slot without consuming a token -- so the loop always
 *   re-checks the ring under the lock and a stale token costs one extra
 *   iteration, never a lost message.
 *
 ****************************************************************************/

static int bt_osi_push_to_queue(void **queue, void *message,
                                uint32_t timeout_ms)
{
  struct bt_osi_queue_s *q;
  irqstate_t flags;
  clock_t start;
  clock_t total;
  bool blocking;

  if (queue == NULL || *queue == NULL || message == NULL)
    {
      return -1;
    }

  q = *queue;
  blocking = timeout_ms != BT_OSI_NO_WAIT && !up_interrupt_context();
  start = clock_systime_ticks();
  total = timeout_ms == BT_OSI_WAIT_FOREVER ? 0 : MSEC2TICK(timeout_ms);

  for (; ; )
    {
      flags = up_irq_save();
      if (q->used < q->capacity)
        {
          memcpy(q->buf + q->tail * q->msgsize, message, q->msgsize);
          q->tail = (q->tail + 1) % q->capacity;
          q->used++;
          up_irq_restore(flags);

          nxsem_post(&q->fill);
          return 0;
        }

      up_irq_restore(flags);

      if (!blocking)
        {
          return -1;
        }

      if (timeout_ms == BT_OSI_WAIT_FOREVER)
        {
          if (nxsem_wait_uninterruptible(&q->space) < 0)
            {
              return -1;
            }
        }
      else
        {
          clock_t elapsed = clock_systime_ticks() - start;

          if (elapsed >= total ||
              nxsem_tickwait_uninterruptible(&q->space,
                                             total - elapsed) < 0)
            {
              return -1;
            }
        }
    }
}

/****************************************************************************
 * Name: bt_osi_pop_from_queue
 *
 * Description:
 *   Every queued message has posted exactly one 'fill' token, so once the
 *   wait succeeds the ring is guaranteed non-empty.  The vendor never pops
 *   from interrupt context and NuttX's semaphore waits assert against it,
 *   so that case is refused outright rather than half-supported.
 *
 ****************************************************************************/

