Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
static int bt_osi_pop_from_queue(void **queue, void *message,
                                 uint32_t timeout_ms)
{
  struct bt_osi_queue_s *q;
  irqstate_t flags;
  int sval;

  if (queue == NULL || *queue == NULL || message == NULL ||
      up_interrupt_context())
    {
      return -1;
    }

  q = *queue;

  if (bt_osi_wait_sem(&q->fill, timeout_ms) < 0)
    {
      return -1;
    }

  flags = up_irq_save();
  memcpy(message, q->buf + q->head * q->msgsize, q->msgsize);
  q->head = (q->head + 1) % q->capacity;
  q->used--;
  up_irq_restore(flags);

  /* Top the writer hint back up, capped so it cannot grow without bound
   * over the lifetime of a queue nobody ever blocks on.
   */

  if (nxsem_get_value(&q->space, &sval) >= 0 && sval < (int)q->capacity)
    {
      nxsem_post(&q->space);
    }

  return 0;
}

/****************************************************************************
 * Name: bt_osi_thread_entry
 *
 * Description:
 *   NuttX kernel threads take (argc, argv), the vendor's take a void *.
 *   The control block address travels as a hex string in argv[1] --
 *   argv[0] is the task name -- because NuttX copies argument strings onto
 *   the new thread's stack, which makes the handoff race-free without a
 *   global.
 *
 ****************************************************************************/

static int bt_osi_thread_entry(int argc, char *argv[])
{
  struct bt_osi_thread_s *t;

  if (argc < 2)
    {
      return EXIT_FAILURE;
    }

  t = (struct bt_osi_thread_s *)(uintptr_t)strtoul(argv[1], NULL, 16);
  if (t == NULL || t->entry == NULL)
    {
      return EXIT_FAILURE;
    }

  t->entry(t->arg);
  nxsem_post(&t->exited);
  return EXIT_SUCCESS;
}

/****************************************************************************
 * Name: bt_osi_create_thread
 ****************************************************************************/

static int bt_osi_create_thread(void **thread, uint8_t priority,
                                const char *name, void *function,
                                uint32_t stack_size, void *arg)
{
  struct bt_osi_thread_s *t;
  char handoff[24];
  char *argv[2];
  int prio;

  if (thread == NULL || function == NULL)
    {
      return -1;
    }

  t = kmm_zalloc(sizeof(struct bt_osi_thread_s));
  if (t == NULL)
    {
      return -1;
    }

  t->entry = (void (*)(void *))function;
  t->arg   = arg;
  nxsem_init(&t->exited, 0, 0);

  if (priority > BT_OSI_BEKEN_PRIO_MAX)
    {
      priority = BT_OSI_BEKEN_PRIO_MAX;
    }

  prio = BT_OSI_PRIO_BASE + (BT_OSI_BEKEN_PRIO_MAX - priority);

  snprintf(handoff, sizeof(handoff), "%p", t);
  argv[0] = handoff;
  argv[1] = NULL;

  t->pid = kthread_create(name != NULL ? name : "bt_osi", prio,
                          (int)stack_size, bt_osi_thread_entry, argv);
  if (t->pid < 0)
    {
      nxsem_destroy(&t->exited);
      kmm_free(t);
      return -1;
    }

  *thread = t;
  return 0;
}

/****************************************************************************
 * Name: bt_osi_delete_thread
 *
 * Description:
 *   A NULL handle means "delete the caller" in the vendor API.  Otherwise
 *   the control block outlives the thread so that a concurrent
 *   _thread_join() cannot land on freed memory; the join releases it.  A
 *   thread that is deleted and never joined leaks its control block, which
 *   matches how the vendor's own layer treats the case and is bounded by
 *   the number of controller threads.
 *
 ****************************************************************************/

static int bt_osi_delete_thread(void **thread)
{
  struct bt_osi_thread_s *t;

  if (thread == NULL)
    {
      kthread_delete(0);
      return 0;
    }

  t = *thread;
  if (t == NULL)
    {
      return -1;
    }

  kthread_delete(t->pid);
  nxsem_post(&t->exited);
  return 0;
}

static int bt_osi_thread_join(void **thread)
{
  struct bt_osi_thread_s *t;

  if (thread == NULL || *thread == NULL)
    {
      return -1;
    }

  t = *thread;
  nxsem_wait_uninterruptible(&t->exited);
  *thread = NULL;

  nxsem_destroy(&t->exited);
  kmm_free(t);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_init_mutex / lock / unlock / deinit
 *
 * Description:
 *   The lock primitives already exist for the closed libraries' direct
 *   symbol references in bk7258_ble_shim.c; these are the thin adapters
 *   that give them the table's int32_t signature, which is a distinct type
 *   from int on this toolchain.
 *
 ****************************************************************************/

static int32_t bt_osi_init_mutex(void **mutex)
{
  return rtos_init_mutex(mutex);
}

static int32_t bt_osi_lock_mutex(void **mutex)
{
  return rtos_lock_mutex(mutex);
}

static int32_t bt_osi_unlock_mutex(void **mutex)
{
  return rtos_unlock_mutex(mutex);
}

static int32_t bt_osi_deinit_mutex(void **mutex)
{
  mutex_t *m;

  if (mutex == NULL || *mutex == NULL)
    {
      return -1;
    }

  m = *mutex;
  *mutex = NULL;

  nxmutex_destroy(m);
  kmm_free(m);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_init_semaphore / set / get / deinit
 *
 * Description:
 *   max_count is ignored, as it is in the vendor layer: these are pure
 *   signalling semaphores and NuttX counting semaphores have no ceiling.
 *
 ****************************************************************************/

static int32_t bt_osi_init_semaphore(void **semaphore, int32_t max_count)
{
  sem_t *s;

  UNUSED(max_count);

  if (semaphore == NULL)
    {
      return -1;
    }

  s = kmm_malloc(sizeof(sem_t));
  if (s == NULL)
    {
      return -1;
    }

  nxsem_init(s, 0, 0);
  *semaphore = s;
  return 0;
}

static int32_t bt_osi_set_semaphore(void **semaphore)
{
  if (semaphore == NULL || *semaphore == NULL)
    {
      return -1;
    }

  return nxsem_post((sem_t *)*semaphore) < 0 ? -1 : 0;
}

static int32_t bt_osi_get_semaphore(void **semaphore, uint32_t timeout_ms)
{
  if (semaphore == NULL || *semaphore == NULL || up_interrupt_context())
    {
      return -1;
    }

  return bt_osi_wait_sem((sem_t *)*semaphore, timeout_ms) < 0 ? -1 : 0;
}

static int32_t bt_osi_deinit_semaphore(void **semaphore)
{
  sem_t *s;

