Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
  if (semaphore == NULL || *semaphore == NULL)
    {
      return -1;
    }

  s = *semaphore;
  *semaphore = NULL;

  nxsem_destroy(s);
  kmm_free(s);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_timer_worker
 *
 * Description:
 *   The vendor's periodic timer re-arms itself from inside its own
 *   callback (timer_callback1 calls rtos_reload_timer before invoking the
 *   handler) rather than relying on FreeRTOS auto-reload, so re-arming
 *   first here reproduces the original phase behaviour: the period is
 *   measured from callback entry, not from callback return.
 *
 ****************************************************************************/

static void bt_osi_timer_worker(void *arg)
{
  struct bt_osi_timer_s *t = arg;

  if (!t->oneshot && t->running)
    {
      work_queue(HPWORK, &t->work, bt_osi_timer_worker, t,
                 MSEC2TICK(t->ms));
    }
  else
    {
      t->running = false;
    }

  if (t->cb != NULL)
    {
      t->cb(t->arg);
    }
}

/****************************************************************************
 * Name: bt_osi_init_timer_ext / init_timer / start / stop / deinit
 ****************************************************************************/

static int32_t bt_osi_init_timer_ext(void **timer, uint32_t time_ms,
                                     void *function, void *arg,
                                     bool oneshot)
{
  struct bt_osi_timer_s *t;

  if (timer == NULL)
    {
      return -1;
    }

  t = kmm_zalloc(sizeof(struct bt_osi_timer_s));
  if (t == NULL)
    {
      return -1;
    }

  t->cb      = (void (*)(void *))function;
  t->arg     = arg;
  t->ms      = time_ms;
  t->oneshot = oneshot;

  *timer = t;
  return 0;
}

static int32_t bt_osi_init_timer(void **timer, uint32_t time_ms,
                                 void *function, void *arg)
{
  return bt_osi_init_timer_ext(timer, time_ms, function, arg, false);
}

static int32_t bt_osi_start_timer(void *timer)
{
  struct bt_osi_timer_s *t = timer;

  if (t == NULL)
    {
      return -1;
    }

  t->running = true;
  return work_queue(HPWORK, &t->work, bt_osi_timer_worker, t,
                    MSEC2TICK(t->ms)) < 0 ? -1 : 0;
}

static int32_t bt_osi_stop_timer(void *timer)
{
  struct bt_osi_timer_s *t = timer;

  if (t == NULL)
    {
      return -1;
    }

  t->running = false;
  work_cancel(HPWORK, &t->work);
  return 0;
}

static int32_t bt_osi_deinit_timer(void *timer)
{
  struct bt_osi_timer_s *t = timer;

  if (t == NULL)
    {
      return -1;
    }

  t->running = false;

  /* Synchronous cancel, so the worker cannot still be mid-callback on a
   * block that is about to be freed.  Not from interrupt context though:
   * the sync path blocks on a semaphore, and an interrupt that landed on
   * the work thread while it ran this very callback would wait on itself.
   * There the plain cancel is the lesser evil -- a torn callback beats a
   * hang -- and the vendor's FreeRTOS timer has the same hole.
   */

  if (up_interrupt_context())
    {
      work_cancel(HPWORK, &t->work);
    }
  else
    {
      work_cancel_sync(HPWORK, &t->work);
    }

  kmm_free(t);
  return 0;
}

static int32_t bt_osi_timer_change_period(void *timer, uint32_t time_ms)
{
  struct bt_osi_timer_s *t = timer;

  if (t == NULL)
    {
      return -1;
    }

  t->ms = time_ms;

  /* The vendor's one-shot reload restarts the timer with the new period;
   * a running periodic timer picks the new period up on its next re-arm.
   */

  if (t->running)
    {
      return work_queue(HPWORK, &t->work, bt_osi_timer_worker, t,
                        MSEC2TICK(time_ms)) < 0 ? -1 : 0;
    }

  return 0;
}

static bool bt_osi_is_timer_init(void *timer)
{
  return timer != NULL;
}

static bool bt_osi_is_timer_running(void *timer)
{
  struct bt_osi_timer_s *t = timer;

  return t != NULL && t->running;
}

/****************************************************************************
 * Name: bt_osi_log
 *
 * Description:
 *   The vendor points this at bk_printf_ext, whose level values follow
 *   components/log.h (1 error .. 4 debug).  The tag is dropped rather than
 *   composed into a scratch buffer: this can be reached from the BLE
 *   interrupt, where a stack buffer large enough for a formatted line is
 *   not something to spend.
 *
 ****************************************************************************/

static void bt_osi_log(int level, char *tag, const char *fmt, ...)
{
  va_list ap;
  int priority;

  UNUSED(tag);

  switch (level)
    {
      case 1:
        priority = LOG_ERR;
        break;

      case 2:
        priority = LOG_WARNING;
        break;

      case 3:
        priority = LOG_INFO;
        break;

      default:
        priority = LOG_DEBUG;
        break;
    }

  va_start(ap, fmt);
  vsyslog(priority, fmt, ap);
  va_end(ap);
}

/****************************************************************************
 * Name: bt_osi_get_time / delay_milliseconds / malloc / free
 ****************************************************************************/

static uint32_t bt_osi_get_time(void)
{
  return (uint32_t)TICK2MSEC(clock_systime_ticks());
}

/* A busy wait rather than nxsig_usleep: the controller calls this from
 * power and clock bring-up paths where it may already hold an interrupt
 * lock, and a sleep there would either assert or never wake.  Interrupts
 * stay enabled, so the cost is CPU time, not latency.
 */

static int bt_osi_delay_milliseconds(uint32_t num_ms)
{
  up_mdelay(num_ms);
  return 0;
}

static void *bt_osi_malloc(unsigned int size)
{
  return kmm_malloc(size);
}

static void bt_osi_free(void *p)
{
  kmm_free(p);
}

/****************************************************************************
 * Name: bt_osi_coex_init
 *
 * Description:
 *   Stub: Wi-Fi is not built into this image, so there is no coexistence
 *   arbiter to bring up.  The vendor compiles its body out under the same
 *   condition and returns success.
 *
 ****************************************************************************/

static int bt_osi_coex_init(void)
{
  return 0;
}

/****************************************************************************
 * Name: bt_osi_isr_handler
 *
 * Description:
 *   The controller hands over an int_group_isr_t, which takes no
 *   arguments; NuttX wants an xcpt_t.  The library's handler travels as
 *   the attach argument so no dispatch table is needed.
 *
 ****************************************************************************/

volatile uint32_t g_bt_isr_hits;

static int bt_osi_isr_handler(int irq, void *context, void *arg)
{
  void (*isr)(void) = (void (*)(void))arg;

  UNUSED(irq);
  UNUSED(context);

  g_bt_isr_hits++;

  if (isr != NULL)
    {
      isr();
    }

  return OK;
}

/****************************************************************************
 * Name: bt_osi_type_to_irq
 *
 * Description:
 *   Map the table's interrupt source enumeration onto this port's IRQ
 *   numbers.  NuttX counts from the start of the exception vector, so the
 *   NVIC line numbers 39/40/41 appear as NVIC_IRQ_FIRST + n, exactly as
 *   include/irq.h already spells them.
 *
 ****************************************************************************/

static int bt_osi_type_to_irq(uint8_t type)
{
  switch (type)
    {
      case BLUETOOTH_INT_SRC_BTDM:
        return BK7258_IRQ_DM;

      case BLUETOOTH_INT_SRC_BLE:
        return BK7258_IRQ_BLE;

      case BLUETOOTH_INT_SRC_BT:
        return BK7258_IRQ_BT;

      default:
        return -1;
    }
}

/****************************************************************************
 * Name: bt_osi_int_isr_register
 *
 * Description:
 *   Attach and enable, because that is what the vendor's Cortex-M path
 *   does: bk_int_isr_register lands in arch_interrupt_register_int, which
 *   installs the vector and calls NVIC_EnableIRQ.  up_enable_irq() also
 *   sets the SoC routing bit for the line -- which on this part gates the
 *   interrupt ahead of the NVIC -- so the line becomes live slightly
 *   earlier than on the vendor, but only after the handler is in place.
 *
 ****************************************************************************/

static int bt_osi_int_isr_register(uint8_t type, void *isr, void *arg)
{
  int irq = bt_osi_type_to_irq(type);

  UNUSED(arg);

  if (irq < 0 || isr == NULL)
    {
      return -1;
    }

  if (irq_attach(irq, bt_osi_isr_handler, isr) < 0)
    {
      return -1;
    }

  up_enable_irq(irq);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_controller_mem_init
 *
 * Description:
 *   Stub: the vendor clears a _bt_data_start.._bt_data_end region, but
 *   only when the controller is configured to reuse the media memory pool
 *   (CONFIG_BT_REUSE_MEDIA_MEMORY).  This port defines no such linker
 *   region, so there is nothing to clear and clearing anything else would
 *   be a guess at another subsystem's memory.
 *
 ****************************************************************************/

static void bt_osi_controller_mem_init(void)
{
}

/****************************************************************************
 * Name: bt_osi_deep_sleep_register / extern32k_register / unregister
 *
 * Description:
 *   Stubs reporting success.  All three register callbacks with the SDK
 *   power manager, which this port does not have; reporting failure would
 *   make the controller treat an absent feature as a broken one.  Since
 *   bt_osi_vote_sleep_ctrl never votes for sleep either, the callbacks
 *   would have nothing to fire on.
 *
 ****************************************************************************/

static int bt_osi_deep_sleep_register(void *enter_config_cb)
{
  UNUSED(enter_config_cb);
  return 0;
}

static int bt_osi_extern32k_register(void *switch_cb)
{
  UNUSED(switch_cb);
  return 0;
}

static int bt_osi_extern32k_unregister(void)
{
  return 0;
}

/****************************************************************************
 * Name: bt_osi_clk_32k_config_get / lpo_src_set / lpo_src_get
 *
 * Description:
 *   Report the 32 kHz sleep clock as derived from the 26 MHz crystal,
 *   which is the one source with an exactly known rate (32000 Hz) and no
 *   calibration loop behind it.  The silicon default is actually the
 *   internal RC oscillator with software calibration, which this port
 *   cannot measure -- see bt_osi_get_rc32k_freq.  Nothing depends on it
 *   while BLE sleep stays off, but it has to be reconciled before the
 *   controller is allowed to sleep.
 *
 ****************************************************************************/

static uint8_t bt_osi_clk_32k_config_get(void)
{
  return BT_LPO_SRC_DIVD;
}

