Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
static int bt_osi_lpo_src_set(uint8_t lpo_src)
{
  UNUSED(lpo_src);
  return 0;
}

static uint8_t bt_osi_lpo_src_get(void)
{
  return BT_LPO_SRC_DIVD;
}

/****************************************************************************
 * Name: bt_osi_bluetooth_power_ctrl / phy_power_ctrl
 *
 * Description:
 *   The vendor routes these through a reference-counted power manager; on
 *   this port CPU0 is the secure master and owns the system block
 *   outright, so the domain bits are written directly.  Both bits are
 *   inverted -- clearing powers the domain up.
 *
 ****************************************************************************/

static int bt_osi_bluetooth_power_ctrl(uint8_t power_state)
{
  modifyreg32(BT_OSI_SYS_POWER,
              power_state ? BT_OSI_PWD_BTSP : 0,
              power_state ? 0 : BT_OSI_PWD_BTSP);
  return 0;
}

static int bt_osi_phy_power_ctrl(uint8_t power_state)
{
  modifyreg32(BT_OSI_SYS_POWER,
              power_state ? BT_OSI_PWD_WIFP_PHY : 0,
              power_state ? 0 : BT_OSI_PWD_WIFP_PHY);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_bt_mac_clock_ctrl / bt_phy_clock_ctrl
 ****************************************************************************/

static int bt_osi_bt_mac_clock_ctrl(uint8_t clock_state)
{
  modifyreg32(BT_OSI_SYS_CLK_EN,
              clock_state ? 0 : BT_OSI_CKEN_BTDM,
              clock_state ? BT_OSI_CKEN_BTDM : 0);
  return 0;
}

static int bt_osi_bt_phy_clock_ctrl(uint8_t clock_state)
{
  modifyreg32(BT_OSI_SYS_CLK_EN,
              clock_state ? 0 : BT_OSI_CKEN_XVR,
              clock_state ? BT_OSI_CKEN_XVR : 0);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_btdm_interrupt_ctrl / ble_interrupt_ctrl / bt_interrupt_ctrl
 *
 * Description:
 *   The vendor toggles the per-CPU routing bit for the line (bits 7/8/9 of
 *   cpu0_int_32_63_en).  up_enable_irq()/up_disable_irq() on this port set
 *   and clear that same bit together with the NVIC enable, so they gate
 *   the line the same way and stay symmetric with each other.
 *
 ****************************************************************************/

static void bt_osi_btdm_interrupt_ctrl(bool en)
{
  if (en)
    {
      up_enable_irq(BK7258_IRQ_DM);
    }
  else
    {
      up_disable_irq(BK7258_IRQ_DM);
    }
}

static void bt_osi_ble_interrupt_ctrl(bool en)
{
  if (en)
    {
      up_enable_irq(BK7258_IRQ_BLE);
    }
  else
    {
      up_disable_irq(BK7258_IRQ_BLE);
    }
}

static void bt_osi_bt_interrupt_ctrl(bool en)
{
  if (en)
    {
      up_enable_irq(BK7258_IRQ_BT);
    }
  else
    {
      up_disable_irq(BK7258_IRQ_BT);
    }
}

/****************************************************************************
 * Name: bt_osi_ate_is_enabled / cp_test_is_enabled
 *
 * Description:
 *   Stubs reporting "off".  Both gate production-test entry points that
 *   reconfigure the RF away from normal operation; the vendor's real
 *   implementations read a boot pin latch this port does not sample, and
 *   reporting off is the state a shipped board is in.
 *
 ****************************************************************************/

static bool bt_osi_ate_is_enabled(void)
{
  return false;
}

static bool bt_osi_cp_test_is_enabled(void)
{
  return false;
}

/****************************************************************************
 * Name: bt_osi_get_bluetooth_mac
 *
 * Description:
 *   Placeholder address, OUI first.  A production implementation must read
 *   the per-unit address from OTP bank 1, falling back to the flash
 *   sys_net partition, the way bk_get_mac(MAC_TYPE_BLUETOOTH) does; until
 *   then every board built from this tree advertises the same address, so
 *   two of them cannot be told apart or connected to at once.
 *
 ****************************************************************************/

static int bt_osi_get_bluetooth_mac(uint8_t *mac)
{
  static const uint8_t placeholder[6] =
  {
    0xc8, 0x47, 0x8c, 0x25, 0x20, 0x26
  };

  if (mac == NULL)
    {
      return -1;
    }

  memcpy(mac, placeholder, sizeof(placeholder));
  return 0;
}

/****************************************************************************
 * Name: bt_osi_uart_* / bt_osi_get_printf_port
 *
 * Description:
 *   Stubs.  These exist for the vendor's HCI-over-UART passthrough and
 *   bkreg console, where the controller takes a UART away from the
 *   application and drives it byte by byte.  This port keeps UART0 as the
 *   NuttX console; letting the controller seize it would take the shell
 *   down, and interleaving raw HCI into the console stream would corrupt
 *   both.  The read/write entries report failure so a caller that ignores
 *   the port query still cannot get half a transfer.
 *
 ****************************************************************************/

static int bt_osi_uart_write_byte(uint8_t id, uint8_t data)
{
  UNUSED(id);
  UNUSED(data);
  return -1;
}

static int bt_osi_uart_read_byte_ex(uint8_t id, uint8_t *ch)
{
  UNUSED(id);
  UNUSED(ch);
  return -1;
}

static int bt_osi_uart_enable_rx_interrupt(uint8_t id)
{
  UNUSED(id);
  return -1;
}

static int bt_osi_uart_take_rx_isr(uint8_t id, void *isr, void *param)
{
  UNUSED(id);
  UNUSED(isr);
  UNUSED(param);
  return -1;
}

static void bt_osi_uart_enable(uint8_t uart_id, uint8_t enable,
                               uint32_t band)
{
  UNUSED(uart_id);
  UNUSED(enable);
  UNUSED(band);
}

static int bt_osi_get_printf_port(void)
{
  return 0;
}

/****************************************************************************
 * Name: bt_osi_register_ble_dump_hook
 *
 * Description:
 *   Stub: the vendor only installs this hook on its RISC-V parts, where
 *   the exception dumper calls back into the controller for link state.
 *   The Cortex-M build leaves it empty too.
 *
 ****************************************************************************/

static void bt_osi_register_ble_dump_hook(void *ble_func)
{
  UNUSED(ble_func);
}

/****************************************************************************
 * Name: bt_osi_gpio_dev_unmap / bt_osi_gpio_dev_map
 *
 * Description:
 *   unmap takes a pin back from whatever peripheral held it and parks it
 *   as a plain input.  map cannot be implemented: its 'func' argument is a
 *   vendor GPIO_DEV_* device identifier, and turning that into this part's
 *   per-pin alternate-function index needs the SDK's gpio_map table, which
 *   this port does not carry.  Failing is the honest answer -- picking an
 *   alternate function at random would route a live peripheral onto an
 *   arbitrary pad.
 *
 ****************************************************************************/

static int bt_osi_gpio_dev_unmap(uint32_t gpio_id)
{
  if (gpio_id >= BK7258_NGPIOS)
    {
      return -1;
    }

  bk7258_gpio_config((int)gpio_id, false, false, false);
  return 0;
}

