Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
static int bt_osi_gpio_dev_map(uint32_t gpio_id, uint32_t func)
{
  UNUSED(gpio_id);
  UNUSED(func);
  return -1;
}

/****************************************************************************
 * Name: bt_osi_gpio_*
 *
 * Description:
 *   Pull control touches only the pull bits: the controller uses these to
 *   adjust a pad it has already configured, so forcing a direction here
 *   would undo that.
 *
 ****************************************************************************/

static int bt_osi_gpio_disable_pull(uint32_t gpio_id)
{
  if (gpio_id >= BK7258_NGPIOS)
    {
      return -1;
    }

  modifyreg32(BK7258_GPIO_CFG(gpio_id),
              GPIO_CFG_PULL_EN | GPIO_CFG_PULL_UP, 0);
  return 0;
}

static int bt_osi_gpio_pull_up(uint32_t gpio_id)
{
  if (gpio_id >= BK7258_NGPIOS)
    {
      return -1;
    }

  modifyreg32(BK7258_GPIO_CFG(gpio_id), 0,
              GPIO_CFG_PULL_EN | GPIO_CFG_PULL_UP);
  return 0;
}

static int bt_osi_gpio_pull_down(uint32_t gpio_id)
{
  if (gpio_id >= BK7258_NGPIOS)
    {
      return -1;
    }

  modifyreg32(BK7258_GPIO_CFG(gpio_id), GPIO_CFG_PULL_UP,
              GPIO_CFG_PULL_EN);
  return 0;
}

static int bt_osi_gpio_enable_output(uint32_t gpio_id)
{
  if (gpio_id >= BK7258_NGPIOS)
    {
      return -1;
    }

  bk7258_gpio_config((int)gpio_id, true, false, false);
  return 0;
}

static int bt_osi_gpio_set_output_high(uint32_t gpio_id)
{
  if (gpio_id >= BK7258_NGPIOS)
    {
      return -1;
    }

  bk7258_gpio_write((int)gpio_id, true);
  return 0;
}

static int bt_osi_gpio_set_output_low(uint32_t gpio_id)
{
  if (gpio_id >= BK7258_NGPIOS)
    {
      return -1;
    }

  bk7258_gpio_write((int)gpio_id, false);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_set_printf_enable / enable_debug_gpio
 *
 * Description:
 *   Stubs.  The first mutes the vendor console, which this port does not
 *   route through the controller anyway.  The second remaps roughly thirty
 *   pads to internal debug signals; on this board those pads carry the
 *   camera, display and audio, so honouring it would take the product
 *   apart to service a debug probe nobody attached.
 *
 ****************************************************************************/

static void bt_osi_set_printf_enable(uint8_t enable)
{
  UNUSED(enable);
}

static void bt_osi_enable_debug_gpio(void)
{
}

/****************************************************************************
 * Name: bt_osi_evm_stop_bypass_mac / bt_osi_rs_deinit
 *
 * Description:
 *   Stubs, matching the vendor with Wi-Fi disabled: both tear down Wi-Fi
 *   MAC state before the RF is handed to bluetooth, and there is no Wi-Fi
 *   MAC in this image to tear down.
 *
 ****************************************************************************/

static void bt_osi_evm_stop_bypass_mac(void)
{
}

static void bt_osi_rs_deinit(void)
{
}

/****************************************************************************
 * Name: bt_osi_ble_vote_rf_ctrl / bt_osi_ble_ate_vote_rf_ctrl
 *
 * Description:
 *   Forwarded to the closed RF arbiter with the caller's role bit, exactly
 *   as the vendor does.
 *
 ****************************************************************************/

static void bt_osi_ble_vote_rf_ctrl(uint8_t cmd)
{
  rf_module_vote_ctrl(cmd, BT_OSI_RF_BY_BLE_BIT);
}

static void bt_osi_ble_ate_vote_rf_ctrl(uint8_t cmd)
{
  rf_module_vote_ctrl(cmd, BT_OSI_RF_BY_ATE_BT_BIT);
}

/****************************************************************************
 * Name: bt_osi_manual_cal_save_ble_txpwr
 *
 * Description:
 *   The calibration table is indexed by rate; the vendor files every BLE
 *   result under the same synthetic rate index 158.
 *
 ****************************************************************************/

static void bt_osi_manual_cal_save_ble_txpwr(uint32_t channel,
                                             uint32_t pwr_gain)
{
  manual_cal_save_txpwr(BT_OSI_EVM_BLE_RATE, channel, pwr_gain);
}

/****************************************************************************
 * Name: bt_osi_bt_rf_pll_ctrl
 *
 * Description:
 *   Stub returning success, matching the vendor with Wi-Fi disabled.  The
 *   call asks the arbiter to hold the Wi-Fi PLL on behalf of bluetooth;
 *   with no Wi-Fi in the image the BT PLL is the only one running and
 *   there is nothing to hold.
 *
 ****************************************************************************/

static uint32_t bt_osi_bt_rf_pll_ctrl(uint32_t set)
{
  UNUSED(set);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_reboot
 *
 * Description:
 *   Stub that only complains.  The controller reaches for this on
 *   unrecoverable internal errors; during bring-up a silent reset would
 *   destroy the evidence, and the log line survives it.  Wire this to
 *   up_systemreset() once the stack is trusted.
 *
 ****************************************************************************/

static void bt_osi_reboot(void)
{
  syslog(LOG_ERR, "bt_osi: controller requested reboot, ignored\n");
}

/****************************************************************************
 * Name: bt_osi_bt_vote_sleep_ctrl / bt_ext_wakeup_ctrl
 *
 * Description:
 *   Stubs.  Both talk to the SDK power manager: the first votes the
 *   bluetooth domain into or out of low power, the second arms the
 *   external wakeup path out of it.  This port never lowers the domain, so
 *   reporting success keeps the controller's own state machine consistent
 *   without anything actually going to sleep.
 *
 ****************************************************************************/

static int bt_osi_bt_vote_sleep_ctrl(uint32_t sleep_state,
                                     uint32_t sleep_time)
{
  UNUSED(sleep_state);
  UNUSED(sleep_time);
  return 0;
}

static void bt_osi_bt_ext_wakeup_ctrl(uint8_t enable)
{
  UNUSED(enable);
}

/****************************************************************************
 * Name: bt_osi_btsnoop
 *
 * Description:
 *   Stub: the vendor dumps every HCI packet out a UART, which this port
 *   does not lend to the controller (see bt_osi_uart_write_byte).
 *
 ****************************************************************************/

static void bt_osi_btsnoop(uint8_t uart_id, uint8_t pkt_type,
                           uint8_t is_rxed, uint8_t *pkt, uint16_t pkt_len,
                           uint8_t method)
{
  UNUSED(uart_id);
  UNUSED(pkt_type);
  UNUSED(is_rxed);
  UNUSED(pkt);
  UNUSED(pkt_len);
  UNUSED(method);
}

/****************************************************************************
 * Name: bt_osi_get_sys_debug_config_addr / chip identity
 *
 * Description:
 *   Addresses and constants copied from the SDK's bk7258 sys_reg.h and
 *   sys_types.h.  _get_chipid answers with the only revision the vendor
 *   table knows; _get_current_chipid reads the AON PMU identity register
 *   that aon_pmu_hal_get_chipid() reads.
 *
 ****************************************************************************/

static size_t bt_osi_get_sys_debug_config_addr(uint32_t index)
{
  return index == 0 ? BT_OSI_SYS_DEBUG_CFG0 : BT_OSI_SYS_DEBUG_CFG1;
}

static uint32_t bt_osi_get_chipid_mask(void)
{
  return BT_OSI_CHIP_ID_MASK;
}

static uint32_t bt_osi_get_chipid(uint32_t ver)
{
  UNUSED(ver);
  return BT_OSI_CHIP_ID_MPW_V4;
}

static uint32_t bt_osi_get_current_chipid(void)
{
  return getreg32(BT_OSI_AON_PMU_CHIPID);
}

/****************************************************************************
 * Name: bt_osi_get_test_rfconfig / bt_osi_get_rf_mode
 *
 * Description:
 *   Both variables live in the closed PHY archive and are set by its own
 *   configuration path; the table only reads them back.
 *
 ****************************************************************************/

static uint32_t bt_osi_get_test_rfconfig(void)
{
  return test_rfconfig;
}

static uint8_t bt_osi_get_rf_mode(void)
{
  /* The vendor derives this from rwnx_rfconfig, and doing the same
   * here answers BT_RF_MODE_WIFI: the variable reads 0x101 on this
   * board, meaning PLL and role both Wi-Fi.  That is the Wi-Fi PHY
   * archive's own default, and it is the archive we link -- the
   * vendor's no-Wi-Fi build takes libcom_phy.a instead.  Answering it
   * honestly points the transmitter at a Wi-Fi PLL that nothing on
   * this port ever starts, which is exactly the shape of the symptom:
   * the receiver hears the room and nothing hears us.
   *
   * A BLE-only board runs its own polar modulator, so say so.  The
   * architecturally clean fix is to link libcom_phy.a instead, which
   * would make this derivation correct again.
   */

  return BT_RF_MODE_POLAR;
}

/****************************************************************************
 * Name: bt_osi_bkreg_run_command
 *
 * Description:
 *   Stub reporting "nothing consumed".  bkreg is the vendor's register
 *   poke console, gated behind CONFIG_CLI && CONFIG_BKREG in their build
 *   and absent here.
 *
 ****************************************************************************/

static int bt_osi_bkreg_run_command(const char *content, int cnt)
{
  UNUSED(content);
  UNUSED(cnt);
  return 0;
}

/****************************************************************************
 * Name: bt_osi_manual_cal_is_in_cali_mode
 *
 * Description:
 *   The table's name and the archive's name disagree: the closed library
 *   exports manual_cal_is_in_rftest_mode, which is what the vendor's own
 *   wrapper calls too.
 *
 ****************************************************************************/

static uint32_t bt_osi_manual_cal_is_in_cali_mode(void)
{
  return manual_cal_is_in_rftest_mode();
}

/****************************************************************************
 * Name: bt_osi_get_rc32k_freq
 *
 * Description:
 *   Returns the exact rate implied by bt_osi_clk_32k_config_get()'s
 *   answer.  The vendor measures the RC oscillator with the CKMN block
 *   when the sleep clock comes from it; this port has no CKMN driver, so
 *   it reports the source it can state exactly instead of a measurement it
 *   cannot make.  The X32K arm is kept for the day the board gains a
 *   32.768 kHz crystal.
 *
 ****************************************************************************/

static double bt_osi_get_rc32k_freq(void)
{
  if (bt_osi_lpo_src_get() == BT_LPO_SRC_X32K)
    {
      return BLUETOOTH_CLK_32768;
    }

  return BLUETOOTH_CLK_32K;
}

/****************************************************************************
 * Name: bt_osi_flush_dcache
 *
 * Description:
 *   Stub: the data cache is disabled on this port, so there is never a
 *   dirty line between the controller and the DMA engines it shares
 *   buffers with.
 *
 ****************************************************************************/

static void bt_osi_flush_dcache(void)
{
}

/****************************************************************************
 * Name: bt_osi_ble_enter_dut / bt_osi_ble_exit_dut
 *
 * Description:
 *   Forwarded to the closed calibration library, whose entry points were
 *   confirmed present.  They only run when the controller is put into
 *   device-under-test mode, which bt_osi_ate_is_enabled() declines.
 *
 ****************************************************************************/

