Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
static void bt_osi_ble_enter_dut(void)
{
  ble_cal_enter_dut();
}

static void bt_osi_ble_exit_dut(void)
{
  ble_cal_exit_dut();
}

/****************************************************************************
 * Name: bt_osi_set_bluetooth_power_level
 *
 * Description:
 *   Reproduces the vendor sequence.  bk_ble_set_tx_power() is SDK glue and
 *   is not in any archive here, so its one-line body is inlined: it is
 *   manual_cal_set_tx_power() with the "not a Wi-Fi standard" selector,
 *   which is how the calibration layer spells BLE.  The index reported
 *   back is clamped to the table, but -- as in the vendor -- the
 *   unclamped index is the one programmed.
 *
 ****************************************************************************/

static uint8_t bt_osi_set_bluetooth_power_level(float pwr_gain)
{
  uint8_t max_index;
  uint8_t index;

  manual_cal_set_tx_power(0, pwr_gain);

  index = manual_cal_get_ble_pwr_idx(19);
  max_index = get_ble_txpwr_table_size() - 1;
  ble_cal_set_txpwr(index);

  return index > max_index ? max_index : index;
}

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Must stay out of .rodata.  The vendor learned the hard way that a const
 * table costs enough extra cycles on every indirect call to make the audio
 * paths miss their deadline and trip the watchdog, and the library writes
 * nothing here, so there is no protection being given up.
 *
 * _phy_enable_rx_switch and _coexist_check_large_signal are left NULL on
 * purpose, exactly as the vendor's own table leaves them: both are
 * feature probes as much as callbacks -- an external RX switch and a
 * Wi-Fi coexistence arbiter, neither of which this board has -- and an
 * empty stub would answer "present" to a question whose honest answer is
 * "absent".
 */

struct bt_osi_funcs_t g_bt_osi_funcs =
{
  ._version                             = BT_OSI_VERSION,
  .size                                 = sizeof(struct bt_osi_funcs_t),

  ._init_queue                          = bt_osi_init_queue,
  ._deinit_queue                        = bt_osi_deinit_queue,
  ._pop_from_queue                      = bt_osi_pop_from_queue,
  ._push_to_queue                       = bt_osi_push_to_queue,
  ._create_thread                       = bt_osi_create_thread,
  ._delete_thread                       = bt_osi_delete_thread,
  ._thread_join                         = bt_osi_thread_join,

  ._init_mutex                          = bt_osi_init_mutex,
  ._lock_mutex                          = bt_osi_lock_mutex,
  ._unlock_mutex                        = bt_osi_unlock_mutex,
  ._deinit_mutex                        = bt_osi_deinit_mutex,

  ._init_semaphore                      = bt_osi_init_semaphore,
  ._set_semaphore                       = bt_osi_set_semaphore,
  ._get_semaphore                       = bt_osi_get_semaphore,
  ._deinit_semaphore                    = bt_osi_deinit_semaphore,

  ._init_timer                          = bt_osi_init_timer,
  ._init_timer_ext                      = bt_osi_init_timer_ext,
  ._deinit_timer                        = bt_osi_deinit_timer,
  ._stop_timer                          = bt_osi_stop_timer,

  ._timer_change_period                 = bt_osi_timer_change_period,
  ._is_timer_init                       = bt_osi_is_timer_init,
  ._start_timer                         = bt_osi_start_timer,
  ._is_timer_running                    = bt_osi_is_timer_running,

  ._log                                 = bt_osi_log,
  ._get_time                            = bt_osi_get_time,
  ._delay_milliseconds                  = bt_osi_delay_milliseconds,

  ._malloc                              = bt_osi_malloc,
  ._free                                = bt_osi_free,

  ._coex_init                           = bt_osi_coex_init,
  ._bluetooth_int_isr_register          = bt_osi_int_isr_register,

  ._controller_mem_init                 = bt_osi_controller_mem_init,
  ._bluetooth_deep_sleep_register       = bt_osi_deep_sleep_register,
  ._bluetooth_extern32k_register        = bt_osi_extern32k_register,
  ._bluetooth_extern32k_unregister      = bt_osi_extern32k_unregister,
  ._clk_32k_customer_config_get         = bt_osi_clk_32k_config_get,
  ._lpo_src_set                         = bt_osi_lpo_src_set,
  ._lpo_src_get                         = bt_osi_lpo_src_get,
  ._bluetooth_power_ctrl                = bt_osi_bluetooth_power_ctrl,
  ._phy_power_ctrl                      = bt_osi_phy_power_ctrl,
  ._bt_mac_clock_ctrl                   = bt_osi_bt_mac_clock_ctrl,
  ._bt_phy_clock_ctrl                   = bt_osi_bt_phy_clock_ctrl,
  ._btdm_interrupt_ctrl                 = bt_osi_btdm_interrupt_ctrl,
  ._ble_interrupt_ctrl                  = bt_osi_ble_interrupt_ctrl,
  ._bt_interrupt_ctrl                   = bt_osi_bt_interrupt_ctrl,
  ._ate_is_enabled                      = bt_osi_ate_is_enabled,
  ._cp_test_is_enabled                  = bt_osi_cp_test_is_enabled,
  ._get_bluetooth_mac                   = bt_osi_get_bluetooth_mac,
  ._uart_write_byte                     = bt_osi_uart_write_byte,
  ._register_ble_dump_hook              = bt_osi_register_ble_dump_hook,
  ._get_ble_pwr_idx                     = bt_osi_ble_pwr_idx,
  ._ble_cal_set_txpwr                   = ble_cal_set_txpwr,
  ._ble_cal_recover_txpwr               = ble_cal_recover_txpwr,
  ._ble_cal_enter_txpwr                 = ble_cal_enter_txpwr,
  ._gpio_dev_unmap                      = bt_osi_gpio_dev_unmap,
  ._gpio_dev_map                        = bt_osi_gpio_dev_map,
  ._set_printf_enable                   = bt_osi_set_printf_enable,
  ._evm_stop_bypass_mac                 = bt_osi_evm_stop_bypass_mac,
  ._rs_deinit                           = bt_osi_rs_deinit,
  ._phy_enable_rx_switch                = NULL,
  ._uart_enable_rx_interrupt            = bt_osi_uart_enable_rx_interrupt,
  ._uart_take_rx_isr                    = bt_osi_uart_take_rx_isr,
  ._ble_vote_rf_ctrl                    = bt_osi_ble_vote_rf_ctrl,
  ._ble_ate_vote_rf_ctrl                = bt_osi_ble_ate_vote_rf_ctrl,

  ._disable_int                         = rtos_disable_int,
  ._enable_int                          = rtos_enable_int,
  ._gpio_disable_pull                   = bt_osi_gpio_disable_pull,
  ._gpio_enable_output                  = bt_osi_gpio_enable_output,
  ._gpio_set_output_high                = bt_osi_gpio_set_output_high,
  ._gpio_set_output_low                 = bt_osi_gpio_set_output_low,
  ._gpio_pull_down                      = bt_osi_gpio_pull_down,
  ._gpio_pull_up                        = bt_osi_gpio_pull_up,
  ._get_printf_port                     = bt_osi_get_printf_port,
  ._uart_enable                         = bt_osi_uart_enable,
  ._enable_debug_gpio                   = bt_osi_enable_debug_gpio,

