Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_bt_osi.c
  ._manual_cal_save_ble_txpwr           = bt_osi_manual_cal_save_ble_txpwr,

  ._bt_rf_pll_ctrl                      = bt_osi_bt_rf_pll_ctrl,
  ._reboot                              = bt_osi_reboot,
  ._uart_read_byte_ex                   = bt_osi_uart_read_byte_ex,
  ._bt_vote_sleep_ctrl                  = bt_osi_bt_vote_sleep_ctrl,
  ._coexist_check_large_signal          = NULL,
  ._bt_ext_wakeup_ctrl                  = bt_osi_bt_ext_wakeup_ctrl,
  ._btsnoop                             = bt_osi_btsnoop,

  ._get_sys_debug_config_addr           = bt_osi_get_sys_debug_config_addr,
  ._get_chipid_mask                     = bt_osi_get_chipid_mask,
  ._get_chipid                          = bt_osi_get_chipid,
  ._get_current_chipid                  = bt_osi_get_current_chipid,
  ._get_test_rfconfig                   = bt_osi_get_test_rfconfig,
  ._get_rf_mode                         = bt_osi_get_rf_mode,

  ._bkreg_run_command                   = bt_osi_bkreg_run_command,

  ._manual_cal_txpwr_tab_ready_in_flash =
                                    manual_cal_txpwr_tab_ready_in_flash,
  ._manual_cal_is_in_cali_mode          =
                                    bt_osi_manual_cal_is_in_cali_mode,
  ._bk_driver_get_rc32k_freq            = bt_osi_get_rc32k_freq,
  ._flush_dcache                        = bt_osi_flush_dcache,

  ._ble_enter_dut                       = bt_osi_ble_enter_dut,
  ._ble_exit_dut                        = bt_osi_ble_exit_dut,
  ._set_bluetooth_power_level           = bt_osi_set_bluetooth_power_level,
};

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_bt_osi_init
 *
 * Description:
 *   Hand the OS abstraction table to the closed bluetooth controller.
 *   Must run before any other controller entry point; the library's
 *   return value is passed through unchanged, and a non-zero value means
 *   it rejected the table (version or size mismatch).
 *
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_bt_osi_diag
 *
 * Description:
 *   Report whether the radio's interrupts actually reach the CPU: the
 *   hit count, the SoC routing matrix word that gates lines 32..63
 *   ahead of the NVIC, and the NVIC enable word covering the same
 *   lines.  Bits 7/8/9 of the routing word are DM/BLE/BT.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: bt_osi_ble_pwr_idx
 *
 * Description:
 *   The controller asks for a transmit level per channel and applies
 *   the answer itself, so this callback is the only place a level
 *   actually sticks -- setting one before advertising starts is
 *   overwritten on the first event, which is why an earlier override
 *   proved nothing.  The library's own answer comes from a calibration
 *   that had no factory record and read TSSI with the transmitter
 *   possibly unkeyed, so a plausible-looking index can still mean no
 *   output.  Clamp upward while the receiver works and nothing hears
 *   the transmitter; if this is what carries, the calibrated value is
 *   the thing to fix rather than this floor.
 *
 ****************************************************************************/

static uint8_t bt_osi_ble_pwr_idx(uint8_t channel)
{
  uint8_t idx = manual_cal_get_ble_pwr_idx(channel);

  return idx < 60 ? 60 : idx;
}

void bk7258_bt_rf_diag(void)
{
  syslog(LOG_INFO, "bt: rwnx_rfconfig %08lx test_rfconfig %08lx "
                   "rf_mode %u\n",
         (unsigned long)rwnx_rfconfig, (unsigned long)test_rfconfig,
         bt_osi_get_rf_mode());
}

void bk7258_bt_osi_diag(void)
{
  syslog(LOG_INFO,
         "bt: isr %lu route %08lx pwr %08lx clk %08lx lpo %08lx\n",
         (unsigned long)g_bt_isr_hits,
         (unsigned long)getreg32(0x44010084ul),
         (unsigned long)getreg32(0x44010040ul),
         (unsigned long)getreg32(0x44010030ul),
         (unsigned long)getreg32(0x44000104ul));
}

int bk7258_bt_osi_init(void)
{
  return bt_os_adapter_init(&g_bt_osi_funcs);
}
